# BoundaryNoOverlap Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..BoundaryNoOverlap Property
BuiltInFailures..::..SketchFailures Class See Also
---
The split sketch is out of the boundary of split element sketch..
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BoundaryNoOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryNoOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BoundaryNoOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace